---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.PropertyIntersect
source: html/5db506ae-4a4c-a4a6-02da-57b6704a7bca.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.PropertyIntersect Property

Property lines intersect. Area calculations will not be precise.

## Syntax (C#)
```csharp
public static FailureDefinitionId PropertyIntersect { get; }
```